study/nix/tools.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Nix Tools</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">Nix Tools</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orga620348">disko</a>
<ul>
<li><a href="#org721426e">Notes</a></li>
<li><a href="#orgeb61cd8">Usage</a></li>
<li><a href="#orgbea2071">Systems</a></li>
<li><a href="#org54df52f"><span class="underline">example</span>: Simple ext4</a></li>
</ul>
</li>
<li><a href="#orgedda3f0">nixos-generators</a>
<ul>
<li><a href="#orgde55bd7">Creating an Image</a></li>
<li><a href="#orgb6f60f7">Building an Image</a></li>
</ul>
</li>
<li><a href="#orgc0a459c">nixos-anywhere</a>
<ul>
<li><a href="#orgf274efc">Setup</a></li>
<li><a href="#org01c6a3d">Tips</a></li>
<li><a href="#orgfe1666d">Description</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orga620348" class="outline-2">
<h2 id="orga620348">disko</h2>
<div class="outline-text-2" id="text-orga620348">
<p>
Used to configure a disk layout.
</p>
<ul class="org-ul">
<li><a href="https://github.com/nix-community/disko">github page</a></li>
</ul>
</div>

<div id="outline-container-org721426e" class="outline-3">
<h3 id="org721426e">Notes</h3>
<div class="outline-text-3" id="text-org721426e">
<ul class="org-ul">
<li>Input -&gt; NixOS module.</li>
<li>Output -&gt; 2 scripts (format + mount) and NixOS configuration to mount disks.</li>
</ul>

<p>
<b>Why not systemd-repart?</b>
</p>
<ul class="org-ul">
<li>only single disk</li>
<li>no zfs</li>
<li>no lvm</li>
</ul>
<p>
Repart has cool features though:
</p>
<ul class="org-ul">
<li>disk image creation without VM</li>
<li>Autoresize on boot</li>
<li>Can populate files</li>
</ul>

<p>
Other disko features
</p>
<ul class="org-ul">
<li>ZFS with multiple devices</li>
<li>Raids with mdadm/lvm</li>
<li>Luks encryption</li>
<li>Bcachefs</li>
<li>disk image creating</li>
<li>checkout /example in the disko repo</li>
</ul>
<p>
Challenges with disko
</p>
<ul class="org-ul">
<li>Options documentation:
<ul class="org-ul">
<li>Disko options are recursive i.e. gpt -&gt; luks -&gt; gpt -&gt; luks &#x2026;</li>
<li>How to generate documentation for this?</li>
</ul></li>

<li>Incremental updates:
<ul class="org-ul">
<li>Currently works only by complete wipe first</li>
<li>Would need state checks first</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-orgeb61cd8" class="outline-3">
<h3 id="orgeb61cd8">Usage</h3>
<div class="outline-text-3" id="text-orgeb61cd8">
<ul class="org-ul">
<li><a href="https://github.com/nix-community/disko/blob/master/docs/quickstart.md">Quickstart Guide - disko github page</a></li>

<li>Get the NixOS iso file from the <a href="https://nixos.org/download.html#nixos-iso">download page</a> and prepare your booting device.</li>

<li><p>
Once booted, check for the name of the drive with <code>lsblk</code>.
</p>

<p>
It can be one of the next list.
</p>
<ul class="org-ul">
<li>vda</li>
<li>sda</li>
<li>nvme0n1</li>
</ul></li>

<li><p>
Copy the disk configuration from the <a href="https://github.com/nix-community/disko/tree/master/example">examples</a> and install.
</p>

<p>
example: simple EFI and EXT4 root.
<code>$ cd /tmp</code>
<code>$ curl https://github.com/nix-community/disko/blob/master/example/simple-efi.nix -o /tmp/disko-config.nix</code>
</p>

<p>
Install
<code>$ sudo nix --experimental-features "nix-command flakes" run github:nix-community/disko -- --mode disko /tmp/disko-config.nix</code>
</p>

<p>
After the install, check that partitions have been added with <code>lsblk</code>.
</p></li>

<li><p>
Complete the NixOS installation.
</p>

<p>
You will need to include the partitioning an formatting configurations that you copied into <code>/tmp/disko-config.nix</code> in your NixOS configuration.
</p>

<p>
Generate the configuration like this.
<code>$ sudo nixos-generate-config --no-filesystems --root /mnt</code>
</p>

<p>
Move the disko configuration to <code>/etc/nixos</code>.
<code>$ sudo mv /tmp/disko-config.nix /mnt/etc/nixos</code>
</p>

<p>
Add the <b>import</b> to <code>configuration.nix</code>
</p>

<div class="org-src-container">
<pre class="src src-nix">imports = [
  ./hardware-configuration.nix
  "${builtins.fetchTarball "https://github.com/nix-community/disko/archive/master.tar.gz"}/module.nix"
  ./disko-config.nix
];
</pre>
</div>

<p>
Finish editing <code>configuration.nix</code> and install your system.
<code>$ sudo nixos-install</code>
<code>$ reboot</code>
</p></li>
</ul>
</div>
</div>

<div id="outline-container-orgbea2071" class="outline-3">
<h3 id="orgbea2071">Systems</h3>
<div class="outline-text-3" id="text-orgbea2071">
<p>
<span class="underline">example</span>: <b>Partition table</b>
</p>
<div class="org-src-container">
<pre class="src src-nix">disko.devices = {
  disk = {
    main = {
      device = "/dev/sda";
      content = {
        type = "gpt"; # You can use legacy, not recommended.
      };
    };
  };
}
</pre>
</div>

<p>
<span class="underline">example</span>: <b>Partition</b>
</p>
<div class="org-src-container">
<pre class="src src-nix">disko.devices.disk.main.content.partitions = {
  ESP = {
    type = "EF00";
    size = "2G";
    content = {
      type = "filesystem";
      format = "vfat";
      mountpoint = "/boot";
    }
  };
  root.size = "100%"
  root.content = {
    type = "filesystem";
    format = "ext4";
  }
};
</pre>
</div>
</div>
</div>

<div id="outline-container-org54df52f" class="outline-3">
<h3 id="org54df52f"><span class="underline">example</span>: Simple ext4</h3>
<div class="outline-text-3" id="text-org54df52f">
<p>
Save it to <code>/tmp/ext4-simple.nix</code> and run it like this.
</p>

<p>
No flake nix:
<code># nix --experimental-features "nix-command flakes" run github:nix-community/disko -- --mode disko /tmp/ext4-simple.nix</code>
</p>

<div class="org-src-container">
<pre class="src src-nix">{
 disko.devices = {
  disk = {
   my-disk = {
    device = "/dev/vda";
    type = "disk";
    content = {
     type = "gpt";
     partitions = {
      ESP = {
       type = "EF00";
       size = "500M";
       content = {
        type = "filesystem";
        format = "vfat";
        mountpoint = "/boot";
       };
      };
      root = {
       size = "100%";
       content = {
        type = "filesystem";
        format = "ext4";
        mountpoint = "/";
       };
      };
     };
    };
   };
  };
 };
}
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgedda3f0" class="outline-2">
<h2 id="orgedda3f0">nixos-generators</h2>
<div class="outline-text-2" id="text-orgedda3f0">
<ul class="org-ul">
<li><a href="https://github.com/nix-community/nixos-generators">github page</a></li>
</ul>

<p>
one config, multiple formats
</p>

<p>
The nixos-generators project allows to take the same NixOS configuration, and generate outputs for different target formats.
</p>

<p>
Just put your stuff into the configuration.nix and then call one of the image builders.
</p>
</div>

<div id="outline-container-orgde55bd7" class="outline-3">
<h3 id="orgde55bd7">Creating an Image</h3>
<div class="outline-text-3" id="text-orgde55bd7">
<p>
When creating an <b>install-iso</b>, remember it won't follow disko but instead just make it regular size.
</p>
</div>
</div>

<div id="outline-container-orgb6f60f7" class="outline-3">
<h3 id="orgb6f60f7">Building an Image</h3>
<div class="outline-text-3" id="text-orgb6f60f7">
<p>
Building an image should just be
</p>
<div class="org-src-container">
<pre class="src src-bash">$ nix build .#&lt;image-name&gt;
</pre>
</div>

<p>
<span class="underline">example</span>: <code>$ nix build '.#blueteam-image'</code>
</p>

<p>
<span class="underline">note</span>: A lot of the systems require a system with kvm installed.
</p>
</div>
</div>
</div>

<div id="outline-container-orgc0a459c" class="outline-2">
<h2 id="orgc0a459c">nixos-anywhere</h2>
<div class="outline-text-2" id="text-orgc0a459c">
<p>
Installs NixOS configuration with disko over SSH in a single command.
<a href="https://github.com/nix-community/nixos-anywhere">https://github.com/nix-community/nixos-anywhere</a>
</p>

<ol class="org-ol">
<li><b>disko</b> is used to configure a disk layout.</li>
<li><b>nixos-anywhere</b> install your NixOS configuration with disko over ssh in a single command.</li>
</ol>

<p>
<b>nixos-anywhere</b> let's you change any linux image / distribution into a NixOS install.
</p>

<p>
Helpful for when a cloud provider doesn't provide with a nixos image.
</p>
</div>

<div id="outline-container-orgf274efc" class="outline-3">
<h3 id="orgf274efc">Setup</h3>
<div class="outline-text-3" id="text-orgf274efc">
<p>
<span class="underline">note</span>: <b>kexec</b> requires at least <i>1.5GB</i> of ram.
</p>

<ol class="org-ol">
<li><p>
Linux Pre-requisites
</p>

<p>
Try to update with the classic.
</p>
<div class="org-src-container">
<pre class="src src-bash"><span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">apt update &amp;&amp; apt upgrade -y</span>
</pre>
</div>

<p>
<b>Ubuntu</b>
Install <b>curl</b>.
</p>
<div class="org-src-container">
<pre class="src src-bash"><span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">apt install curl</span>
</pre>
</div>

<p>
<b>Linux Mint</b>
<b>ssh-client</b> is installed, but <b>ssh-server</b> is not.
</p>
<div class="org-src-container">
<pre class="src src-bash"><span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">apt-get install openssh-server</span>
<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">systemctl enable ssh</span>
</pre>
</div></li>

<li><p>
Running the <i>kexec</i> image
</p>
<div class="org-src-container">
<pre class="src src-bash">$ sudo curl -L https://github.com/nix-community/nixos-images/releases/download/nixos-unstable/nixos-kexec-installer-noninteractive-x86_64-linux.tar.gz | sudo tar -xzf- -C /root &amp;&amp; sudo /root/kexec/run
</pre>
</div></li>

<li><p>
You will now be initialized into a nixos image
</p>

<p>
Proceed to generate the recommended system hardware configuration and modules as normal.
</p>
<div class="org-src-container">
<pre class="src src-bash"><span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">nixos-generate-config --no-filesystems --root /mnt</span>
</pre>
</div></li>

<li><p>
Cloning the repo
</p>

<p>
For <i>kexec</i>.
Add the nixos channel.
</p>
<div class="org-src-container">
<pre class="src src-bash"><span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">nix-channel --add https://nixos.org/channels/nixos-unstable nixos</span>
<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">nix-channel --update</span>
</pre>
</div>

<p>
For <i>regular image</i> and <i>kexec</i>
Get git and neovim.
</p>
<div class="org-src-container">
<pre class="src src-bash">$ nix-shell -p git neovim
</pre>
</div>

<p>
Here clone your own flake repo.
</p></li>

<li><p>
Running nixos-anywhere
</p>

<p>
Configure passwords for nixos and root.
</p>
<div class="org-src-container">
<pre class="src src-bash"><span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">passwd</span>
<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">passwd nixos</span>
<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">ip -c a</span>
</pre>
</div>

<p>
Test the configuration. (not tried)
</p>
<div class="org-src-container">
<pre class="src src-bash">$ nix run --experimental-features <span style="font-style: italic;">'nix-command flakes'</span> github:nix-community/nixos-anywhere -- --flake &lt;path to configuration&gt;<span style="font-weight: bold; font-style: italic;">#</span><span style="font-weight: bold; font-style: italic;">&lt;configuration name&gt; --vm-test</span>
</pre>
</div>

<p>
Running <i>nixos-anywhere</i>.
Remember this is on the <b>host</b>.
</p>
<div class="org-src-container">
<pre class="src src-bash">$ nix run github:nix-community/nixos-anywhere -- --flake &lt;path to configuration&gt;<span style="font-weight: bold; font-style: italic;">#</span><span style="font-weight: bold; font-style: italic;">&lt;configuration name&gt; root@&lt;ip address&gt;`</span>
</pre>
</div>

<p>
<span class="underline">example</span>:
</p>
<div class="org-src-container">
<pre class="src src-bash">$ nix run github:nix-community/nixos-anywhere -- --flake /home/mydir/test#hetzner-cloud root@37.27.18.135
</pre>
</div>

<p>
<span class="underline">after</span>: just in case.
</p>
<div class="org-src-container">
<pre class="src src-bash">$ ssh-copy-id -i &lt;path/to/ssh/key&gt; &lt;root/or/user&gt;@&lt;ip&gt;
</pre>
</div></li>
</ol>
</div>
</div>

<div id="outline-container-org01c6a3d" class="outline-3">
<h3 id="org01c6a3d">Tips</h3>
<div class="outline-text-3" id="text-org01c6a3d">
<p>
Each time you change the machine configuration, update the remote machine.
</p>
<div class="org-src-container">
<pre class="src src-bash">$ nixos-rebuild switch --flake <span style="font-style: italic;">'.#machine1'</span> --target-host root@&lt;ip&gt;
</pre>
</div>

<p>
<span class="underline">note</span>: <b>IMPORTANT</b>
-&gt; Remember the machine has your user ssh key (not root) that's why sudo is not used. 
</p>

<p>
-&gt; If you are using ssh key on another directory and want to use the <code>-i path/to/key</code> flag, pass it to the nix daemon like this.
</p>
<div class="org-src-container">
<pre class="src src-bash">$ export <span style="font-weight: bold; font-style: italic;">NIX_SSHOPTS</span>=<span style="font-style: italic;">'-i /path/to/key'</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgfe1666d" class="outline-3">
<h3 id="orgfe1666d">Description</h3>
<div class="outline-text-3" id="text-orgfe1666d">
<p>
Input
</p>
<ul class="org-ul">
<li>NixOS configuration with a disko config</li>
<li>SSH destination</li>
</ul>
<p>
Output
</p>
<ul class="org-ul">
<li>Installed NixOS on target</li>
</ul>

<p>
How does nixos-anywhere work?
</p>
<ol class="org-ol">
<li>Identifies target</li>
<li>Runs kexec, if no nixos installer is detected</li>
<li>Runs disko</li>
<li>Runs nixos-install</li>
<li>Reboot</li>
</ol>

<p>
Secrets support
</p>
<ul class="org-ul">
<li>nixos-anywhere supports upload secrets to the final system (i.e. bootstraping agenix/sops-nix) and for disk encryption.</li>
</ul>

<p>
Future work
</p>
<ul class="org-ul">
<li>PXE boot.</li>
<li>Automatically generating hardware configuration.</li>
</ul>

<p>
Usage with flakes
</p>
<div class="org-src-container">
<pre class="src src-bash">$ nix run github:numtide/nixos-anywhere -- --flake <span style="font-style: italic;">'.#mysystem'</span> root@yourhost
</pre>
</div>

<p>
Other cool features
Run the interacive nixos-vm test (test locally with an own created vm)
</p>
<div class="org-src-container">
<pre class="src src-bash">$ nix run github:numtide/nixos-anywhere -- -f <span style="font-style: italic;">'.#mysystem'</span> --vm-test
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.3 (<a href="https://orgmode.org">Org</a> mode 9.6.15)</p>
</div>
</body>
</html>
